
#+begin_src J
  gray=:(] ~: (0,}:))"1 @ #:
  gray i.8
#+end_src

#+RESULTS:
: 0 0 0
: 0 0 1
: 0 1 1
: 0 1 0
: 1 1 0
: 1 1 1
: 1 0 1
: 1 0 0


